
* :x: Formatting `failure`
* :white_check_mark: Initialisation  `success`
* :white_check_mark: Validation `success`
* :white_check_mark: Plan `success`

### Dev Plan

<details><summary>Show Plan - no change</summary>

```

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dphoto/dphoto-dev/runs/run-Qz7aiokGxLXmTqXE

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
data.aws_iam_policy_document.index_rw: Reading...
aws_iam_user.cli: Refreshing state... [id=dphoto-dev-cli]
aws_sqs_queue.async_archive_caching_jobs: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-dev-async-archive-caching-jobs.fifo]
aws_sns_topic.archive: Refreshing state... [id=arn:aws:sns:eu-west-1:472045025110:dphoto-dev-archive-jobs]
aws_ssm_parameter.catalog_table_name: Refreshing state... [id=/dphoto/dev/dynamodb/catalog/tableName]
aws_s3_bucket.cache: Refreshing state... [id=dphoto-dev-cache]
aws_s3_bucket.storage: Refreshing state... [id=dphoto-dev-storage]
data.aws_iam_policy_document.index_rw: Read complete after 0s [id=96391162]
aws_iam_policy.index_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-dev-index-rw]
aws_iam_access_key.rolling_cli["2024-04"]: Refreshing state... [id=AKIAW32ATO5LLV7PQWZ4]
aws_iam_user_policy_attachment.cli_table: Refreshing state... [id=dphoto-dev-cli-20220106201132464100000001]
aws_ssm_parameter.iam_policy_dyn_table_rw: Refreshing state... [id=/dphoto/dev/iam/policies/indexRWArn]
aws_ssm_parameter.sqs_archive_url: Refreshing state... [id=/dphoto/dev/sqs/archive/url]
aws_iam_policy.archive_sqs_send: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto-dev-archive-sqs-send]
aws_ssm_parameter.sqs_archive_arn: Refreshing state... [id=/dphoto/dev/sqs/archive/arn]
aws_ssm_parameter.sns_archive_arn: Refreshing state... [id=/dphoto/dev/sns/archive/arn]
data.aws_iam_policy_document.archive_sns_publish: Reading...
aws_sqs_queue_policy.async_archive_caching_jobs: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-dev-async-archive-caching-jobs.fifo]
data.aws_iam_policy_document.archive_sns_publish: Read complete after 0s [id=2893981939]
aws_iam_policy.archive_sns_publish: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto-dev-archive-sns-publish]
aws_ssm_parameter.iam_policy_archive_sqs_send: Refreshing state... [id=/dphoto/dev/iam/policies/archive_sqs_send/arn]
aws_iam_user_policy_attachment.archive_sqs_send: Refreshing state... [id=dphoto-dev-cli-20220727204922913900000001]
aws_iam_user_policy_attachment.archive_sns_publish: Refreshing state... [id=dphoto-dev-cli-20220724154540649600000001]
aws_ssm_parameter.iam_policy_archive_sns_publish: Refreshing state... [id=/dphoto/dev/iam/policies/archive_sns_publish/arn]
aws_s3_bucket_acl.storage: Refreshing state... [id=dphoto-dev-storage,private]
aws_s3_bucket_versioning.storage: Refreshing state... [id=dphoto-dev-storage]
aws_s3_bucket_lifecycle_configuration.storage: Refreshing state... [id=dphoto-dev-storage]
aws_s3_bucket_ownership_controls.storage: Refreshing state... [id=dphoto-dev-storage]
data.aws_iam_policy_document.storage_rw: Reading...
data.aws_iam_policy_document.storage_ro: Reading...
aws_s3_bucket_public_access_block.s3_storage_block_public_access: Refreshing state... [id=dphoto-dev-storage]
aws_ssm_parameter.storage_bucket_name: Refreshing state... [id=/dphoto/dev/s3/storage/bucketName]
data.aws_iam_policy_document.storage_rw: Read complete after 0s [id=1291361169]
data.aws_iam_policy_document.storage_ro: Read complete after 0s [id=606798614]
aws_iam_policy.storage_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-dev-storage-rw]
aws_iam_policy.storage_ro: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-dev-storage-ro]
aws_s3_bucket_ownership_controls.cache: Refreshing state... [id=dphoto-dev-cache]
aws_s3_bucket_versioning.cache: Refreshing state... [id=dphoto-dev-cache]
aws_s3_bucket_acl.cache: Refreshing state... [id=dphoto-dev-cache,private]
aws_ssm_parameter.cache_bucket_name: Refreshing state... [id=/dphoto/dev/s3/cache/bucketName]
aws_s3_bucket_lifecycle_configuration.cache_expiration: Refreshing state... [id=dphoto-dev-cache]
aws_s3_bucket_public_access_block.s3_cache_block_public_access: Refreshing state... [id=dphoto-dev-cache]
data.aws_iam_policy_document.cache_rw: Reading...
data.aws_iam_policy_document.cache_rw: Read complete after 0s [id=2523143975]
aws_iam_user_policy_attachment.cli_bucket: Refreshing state... [id=dphoto-dev-cli-20220106201139836000000003]
aws_ssm_parameter.iam_policy_bucket_ro: Refreshing state... [id=/dphoto/dev/iam/policies/storageROArn]
aws_iam_policy.cache_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-dev-cache-rw]
aws_iam_user_policy_attachment.cli_cache: Refreshing state... [id=dphoto-dev-cli-20220719225358435400000001]
aws_ssm_parameter.iam_policy_cache_rw: Refreshing state... [id=/dphoto/dev/iam/policies/cacheRWArn]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.archive_relocate will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "archive_relocate" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.archive_sqs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "archive_sqs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:eu-west-1:472045025110:dphoto-dev-async-archive-caching-jobs.fifo",
            ]
          + sid       = "Allow SNS to publish messages"

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:eu-west-1:472045025110:dphoto-dev-archive-jobs",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.archive_sqs_send will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "archive_sqs_send" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:eu-west-1:472045025110:dphoto-dev-async-archive-caching-jobs.fifo",
            ]
        }
    }

  # aws_iam_policy.archive_relocate will be created
  + resource "aws_iam_policy" "archive_relocate" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "dphoto-dev-archive-relocate-sqs-send"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
        }
      + tags_all  = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
        }
    }

  # aws_iam_policy.archive_sqs_send will be updated in-place
  ~ resource "aws_iam_policy" "archive_sqs_send" {
        id        = "arn:aws:iam::472045025110:policy/dphoto-dev-archive-sqs-send"
        name      = "dphoto-dev-archive-sqs-send"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sqs:SendMessage"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:eu-west-1:472045025110:dphoto-dev-async-archive-caching-jobs.fifo"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Application" = "dphoto-data"
            "CreatedBy"   = "terraform"
            "Environment" = "dev"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_sqs_queue.archive_relocate will be created
  + resource "aws_sqs_queue" "archive_relocate" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "dphoto-dev-archive-relocate"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 5400
    }

  # aws_sqs_queue.async_archive_caching_jobs will be updated in-place
  ~ resource "aws_sqs_queue" "async_archive_caching_jobs" {
        id                                = "https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-dev-async-archive-caching-jobs.fifo"
        name                              = "dphoto-dev-async-archive-caching-jobs.fifo"
        tags                              = {
            "Application" = "dphoto-data"
            "CreatedBy"   = "terraform"
            "Environment" = "dev"
        }
      ~ visibility_timeout_seconds        = 900 -> 5400
        # (14 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.async_archive_caching_jobs will be updated in-place
  ~ resource "aws_sqs_queue_policy" "async_archive_caching_jobs" {
        id        = "https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-dev-async-archive-caching-jobs.fifo"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:sns:eu-west-1:472045025110:dphoto-dev-archive-jobs"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:eu-west-1:472045025110:dphoto-dev-async-archive-caching-jobs.fifo"
                      - Sid       = "Allow SNS to publish messages"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_ssm_parameter.iam_policy_archive_relocate will be created
  + resource "aws_ssm_parameter" "iam_policy_archive_relocate" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/dev/iam/policies/archive_relocate_send/arn"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.iam_policy_bucket_rw will be created
  + resource "aws_ssm_parameter" "iam_policy_bucket_rw" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/dev/iam/policies/storageRWArn"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.sqs_archive_relocate_arn will be created
  + resource "aws_ssm_parameter" "sqs_archive_relocate_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/dev/sqs/archive_relocate/arn"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.sqs_archive_relocate_url will be created
  + resource "aws_ssm_parameter" "sqs_archive_relocate_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/dev/sqs/archive_relocate/url"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 6 to add, 3 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 8 estimated
           $0.0/mo +$0.0

```

</details>

*Action: `push`*